apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_APB_CTRL_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_APB_CTRL_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* APB_CTRL_SYSCLK_CONF_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SYSCLK_CONF_REG (DR_REG_APB_CTRL_BASE + 0x0)

/* APB_CTRL_RST_TICK_CNT : R/W; bitpos: [12]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RST_TICK_CNT    (BIT(12))
#define APB_CTRL_RST_TICK_CNT_M  (APB_CTRL_RST_TICK_CNT_V << APB_CTRL_RST_TICK_CNT_S)
#define APB_CTRL_RST_TICK_CNT_V  0x00000001
#define APB_CTRL_RST_TICK_CNT_S  12

/* APB_CTRL_CLK_EN : R/W; bitpos: [11]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_EN    (BIT(11))
#define APB_CTRL_CLK_EN_M  (APB_CTRL_CLK_EN_V << APB_CTRL_CLK_EN_S)
#define APB_CTRL_CLK_EN_V  0x00000001
#define APB_CTRL_CLK_EN_S  11

/* APB_CTRL_CLK_320M_EN : R/W; bitpos: [10]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_320M_EN    (BIT(10))
#define APB_CTRL_CLK_320M_EN_M  (APB_CTRL_CLK_320M_EN_V << APB_CTRL_CLK_320M_EN_S)
#define APB_CTRL_CLK_320M_EN_V  0x00000001
#define APB_CTRL_CLK_320M_EN_S  10

/* APB_CTRL_PRE_DIV_CNT : R/W; bitpos: [9:0]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_PRE_DIV_CNT    0x000003ff
#define APB_CTRL_PRE_DIV_CNT_M  (APB_CTRL_PRE_DIV_CNT_V << APB_CTRL_PRE_DIV_CNT_S)
#define APB_CTRL_PRE_DIV_CNT_V  0x000003ff
#define APB_CTRL_PRE_DIV_CNT_S  0

/* APB_CTRL_TICK_CONF_REG register
 * ******* Description ***********
 */

#define APB_CTRL_TICK_CONF_REG (DR_REG_APB_CTRL_BASE + 0x4)

/* APB_CTRL_TICK_ENABLE : R/W; bitpos: [16]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_TICK_ENABLE    (BIT(16))
#define APB_CTRL_TICK_ENABLE_M  (APB_CTRL_TICK_ENABLE_V << APB_CTRL_TICK_ENABLE_S)
#define APB_CTRL_TICK_ENABLE_V  0x00000001
#define APB_CTRL_TICK_ENABLE_S  16

/* APB_CTRL_CK8M_TICK_NUM : R/W; bitpos: [15:8]; default: 7;
 * ******* Description ***********
 */

#define APB_CTRL_CK8M_TICK_NUM    0x000000ff
#define APB_CTRL_CK8M_TICK_NUM_M  (APB_CTRL_CK8M_TICK_NUM_V << APB_CTRL_CK8M_TICK_NUM_S)
#define APB_CTRL_CK8M_TICK_NUM_V  0x000000ff
#define APB_CTRL_CK8M_TICK_NUM_S  8

/* APB_CTRL_XTAL_TICK_NUM : R/W; bitpos: [7:0]; default: 39;
 * ******* Description ***********
 */

#define APB_CTRL_XTAL_TICK_NUM    0x000000ff
#define APB_CTRL_XTAL_TICK_NUM_M  (APB_CTRL_XTAL_TICK_NUM_V << APB_CTRL_XTAL_TICK_NUM_S)
#define APB_CTRL_XTAL_TICK_NUM_V  0x000000ff
#define APB_CTRL_XTAL_TICK_NUM_S  0

/* APB_CTRL_CLK_OUT_EN_REG register
 * ******* Description ***********
 */

#define APB_CTRL_CLK_OUT_EN_REG (DR_REG_APB_CTRL_BASE + 0x8)

/* APB_CTRL_CLK_XTAL_OEN : R/W; bitpos: [10]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_XTAL_OEN    (BIT(10))
#define APB_CTRL_CLK_XTAL_OEN_M  (APB_CTRL_CLK_XTAL_OEN_V << APB_CTRL_CLK_XTAL_OEN_S)
#define APB_CTRL_CLK_XTAL_OEN_V  0x00000001
#define APB_CTRL_CLK_XTAL_OEN_S  10

/* APB_CTRL_CLK40X_BB_OEN : R/W; bitpos: [9]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK40X_BB_OEN    (BIT(9))
#define APB_CTRL_CLK40X_BB_OEN_M  (APB_CTRL_CLK40X_BB_OEN_V << APB_CTRL_CLK40X_BB_OEN_S)
#define APB_CTRL_CLK40X_BB_OEN_V  0x00000001
#define APB_CTRL_CLK40X_BB_OEN_S  9

/* APB_CTRL_CLK_DAC_CPU_OEN : R/W; bitpos: [8]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_DAC_CPU_OEN    (BIT(8))
#define APB_CTRL_CLK_DAC_CPU_OEN_M  (APB_CTRL_CLK_DAC_CPU_OEN_V << APB_CTRL_CLK_DAC_CPU_OEN_S)
#define APB_CTRL_CLK_DAC_CPU_OEN_V  0x00000001
#define APB_CTRL_CLK_DAC_CPU_OEN_S  8

/* APB_CTRL_CLK_ADC_INF_OEN : R/W; bitpos: [7]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_ADC_INF_OEN    (BIT(7))
#define APB_CTRL_CLK_ADC_INF_OEN_M  (APB_CTRL_CLK_ADC_INF_OEN_V << APB_CTRL_CLK_ADC_INF_OEN_S)
#define APB_CTRL_CLK_ADC_INF_OEN_V  0x00000001
#define APB_CTRL_CLK_ADC_INF_OEN_S  7

/* APB_CTRL_CLK_320M_OEN : R/W; bitpos: [6]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_320M_OEN    (BIT(6))
#define APB_CTRL_CLK_320M_OEN_M  (APB_CTRL_CLK_320M_OEN_V << APB_CTRL_CLK_320M_OEN_S)
#define APB_CTRL_CLK_320M_OEN_V  0x00000001
#define APB_CTRL_CLK_320M_OEN_S  6

/* APB_CTRL_CLK160_OEN : R/W; bitpos: [5]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK160_OEN    (BIT(5))
#define APB_CTRL_CLK160_OEN_M  (APB_CTRL_CLK160_OEN_V << APB_CTRL_CLK160_OEN_S)
#define APB_CTRL_CLK160_OEN_V  0x00000001
#define APB_CTRL_CLK160_OEN_S  5

/* APB_CTRL_CLK80_OEN : R/W; bitpos: [4]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK80_OEN    (BIT(4))
#define APB_CTRL_CLK80_OEN_M  (APB_CTRL_CLK80_OEN_V << APB_CTRL_CLK80_OEN_S)
#define APB_CTRL_CLK80_OEN_V  0x00000001
#define APB_CTRL_CLK80_OEN_S  4

