apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
/* APB_CTRL_CLK_BB_OEN : R/W; bitpos: [3]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK_BB_OEN    (BIT(3))
#define APB_CTRL_CLK_BB_OEN_M  (APB_CTRL_CLK_BB_OEN_V << APB_CTRL_CLK_BB_OEN_S)
#define APB_CTRL_CLK_BB_OEN_V  0x00000001
#define APB_CTRL_CLK_BB_OEN_S  3

/* APB_CTRL_CLK44_OEN : R/W; bitpos: [2]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK44_OEN    (BIT(2))
#define APB_CTRL_CLK44_OEN_M  (APB_CTRL_CLK44_OEN_V << APB_CTRL_CLK44_OEN_S)
#define APB_CTRL_CLK44_OEN_V  0x00000001
#define APB_CTRL_CLK44_OEN_S  2

/* APB_CTRL_CLK22_OEN : R/W; bitpos: [1]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK22_OEN    (BIT(1))
#define APB_CTRL_CLK22_OEN_M  (APB_CTRL_CLK22_OEN_V << APB_CTRL_CLK22_OEN_S)
#define APB_CTRL_CLK22_OEN_V  0x00000001
#define APB_CTRL_CLK22_OEN_S  1

/* APB_CTRL_CLK20_OEN : R/W; bitpos: [0]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_CLK20_OEN    (BIT(0))
#define APB_CTRL_CLK20_OEN_M  (APB_CTRL_CLK20_OEN_V << APB_CTRL_CLK20_OEN_S)
#define APB_CTRL_CLK20_OEN_V  0x00000001
#define APB_CTRL_CLK20_OEN_S  0

/* APB_CTRL_WIFI_BB_CFG_REG register
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_BB_CFG_REG (DR_REG_APB_CTRL_BASE + 0xc)

/* APB_CTRL_WIFI_BB_CFG : R/W; bitpos: [31:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_BB_CFG    0xffffffff
#define APB_CTRL_WIFI_BB_CFG_M  (APB_CTRL_WIFI_BB_CFG_V << APB_CTRL_WIFI_BB_CFG_S)
#define APB_CTRL_WIFI_BB_CFG_V  0xffffffff
#define APB_CTRL_WIFI_BB_CFG_S  0

/* APB_CTRL_WIFI_BB_CFG_2_REG register
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_BB_CFG_2_REG (DR_REG_APB_CTRL_BASE + 0x10)

/* APB_CTRL_WIFI_BB_CFG_2 : R/W; bitpos: [31:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_BB_CFG_2    0xffffffff
#define APB_CTRL_WIFI_BB_CFG_2_M  (APB_CTRL_WIFI_BB_CFG_2_V << APB_CTRL_WIFI_BB_CFG_2_S)
#define APB_CTRL_WIFI_BB_CFG_2_V  0xffffffff
#define APB_CTRL_WIFI_BB_CFG_2_S  0

/* APB_CTRL_WIFI_CLK_EN_REG register
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_CLK_EN_REG (DR_REG_APB_CTRL_BASE + 0x14)

/* APB_CTRL_WIFI_CLK_EN : R/W; bitpos: [31:0]; default: 4294762544;
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_CLK_EN    0xffffffff
#define APB_CTRL_WIFI_CLK_EN_M  (APB_CTRL_WIFI_CLK_EN_V << APB_CTRL_WIFI_CLK_EN_S)
#define APB_CTRL_WIFI_CLK_EN_V  0xffffffff
#define APB_CTRL_WIFI_CLK_EN_S  0

/* APB_CTRL_WIFI_RST_EN_REG register
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_RST_EN_REG (DR_REG_APB_CTRL_BASE + 0x18)

/* APB_CTRL_WIFI_RST : R/W; bitpos: [31:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_WIFI_RST    0xffffffff
#define APB_CTRL_WIFI_RST_M  (APB_CTRL_WIFI_RST_V << APB_CTRL_WIFI_RST_S)
#define APB_CTRL_WIFI_RST_V  0xffffffff
#define APB_CTRL_WIFI_RST_S  0

/* APB_CTRL_HOST_INF_SEL_REG register
 * ******* Description ***********
 */

#define APB_CTRL_HOST_INF_SEL_REG (DR_REG_APB_CTRL_BASE + 0x1c)

/* APB_CTRL_PERI_IO_SWAP : R/W; bitpos: [7:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_PERI_IO_SWAP    0x000000ff
#define APB_CTRL_PERI_IO_SWAP_M  (APB_CTRL_PERI_IO_SWAP_V << APB_CTRL_PERI_IO_SWAP_S)
#define APB_CTRL_PERI_IO_SWAP_V  0x000000ff
#define APB_CTRL_PERI_IO_SWAP_S  0

/* APB_CTRL_EXT_MEM_PMS_LOCK_REG register
 * ******* Description ***********
 */

#define APB_CTRL_EXT_MEM_PMS_LOCK_REG (DR_REG_APB_CTRL_BASE + 0x20)

/* APB_CTRL_EXT_MEM_PMS_LOCK : R/W; bitpos: [0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_EXT_MEM_PMS_LOCK    (BIT(0))
#define APB_CTRL_EXT_MEM_PMS_LOCK_M  (APB_CTRL_EXT_MEM_PMS_LOCK_V << APB_CTRL_EXT_MEM_PMS_LOCK_S)
#define APB_CTRL_EXT_MEM_PMS_LOCK_V  0x00000001
#define APB_CTRL_EXT_MEM_PMS_LOCK_S  0

/* APB_CTRL_EXT_MEM_WRITEBACK_BYPASS_REG register
 * ******* Description ***********
 */

#define APB_CTRL_EXT_MEM_WRITEBACK_BYPASS_REG (DR_REG_APB_CTRL_BASE + 0x24)

/* APB_CTRL_WRITEBACK_BYPASS : R/W; bitpos: [0]; default: 0;
 * Set 1 to bypass cache writeback request to external memory so that spi
 * will not check its attribute.
 */

#define APB_CTRL_WRITEBACK_BYPASS    (BIT(0))
#define APB_CTRL_WRITEBACK_BYPASS_M  (APB_CTRL_WRITEBACK_BYPASS_V << APB_CTRL_WRITEBACK_BYPASS_S)
#define APB_CTRL_WRITEBACK_BYPASS_V  0x00000001
#define APB_CTRL_WRITEBACK_BYPASS_S  0

/* APB_CTRL_FLASH_ACE0_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE0_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x28)

/* APB_CTRL_FLASH_ACE0_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE0_ATTR    0x000001ff
#define APB_CTRL_FLASH_ACE0_ATTR_M  (APB_CTRL_FLASH_ACE0_ATTR_V << APB_CTRL_FLASH_ACE0_ATTR_S)
#define APB_CTRL_FLASH_ACE0_ATTR_V  0x000001ff
#define APB_CTRL_FLASH_ACE0_ATTR_S  0

/* APB_CTRL_FLASH_ACE1_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE1_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x2c)

/* APB_CTRL_FLASH_ACE1_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE1_ATTR    0x000001ff
#define APB_CTRL_FLASH_ACE1_ATTR_M  (APB_CTRL_FLASH_ACE1_ATTR_V << APB_CTRL_FLASH_ACE1_ATTR_S)
#define APB_CTRL_FLASH_ACE1_ATTR_V  0x000001ff
#define APB_CTRL_FLASH_ACE1_ATTR_S  0

/* APB_CTRL_FLASH_ACE2_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE2_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x30)

/* APB_CTRL_FLASH_ACE2_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE2_ATTR    0x000001ff
#define APB_CTRL_FLASH_ACE2_ATTR_M  (APB_CTRL_FLASH_ACE2_ATTR_V << APB_CTRL_FLASH_ACE2_ATTR_S)
#define APB_CTRL_FLASH_ACE2_ATTR_V  0x000001ff
#define APB_CTRL_FLASH_ACE2_ATTR_S  0

/* APB_CTRL_FLASH_ACE3_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE3_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x34)

/* APB_CTRL_FLASH_ACE3_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE3_ATTR    0x000001ff
#define APB_CTRL_FLASH_ACE3_ATTR_M  (APB_CTRL_FLASH_ACE3_ATTR_V << APB_CTRL_FLASH_ACE3_ATTR_S)
#define APB_CTRL_FLASH_ACE3_ATTR_V  0x000001ff
#define APB_CTRL_FLASH_ACE3_ATTR_S  0

/* APB_CTRL_FLASH_ACE0_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE0_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x38)

/* APB_CTRL_FLASH_ACE0_ADDR_S : R/W; bitpos: [31:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE0_ADDR_S    0xffffffff
#define APB_CTRL_FLASH_ACE0_ADDR_S_M  (APB_CTRL_FLASH_ACE0_ADDR_S_V << APB_CTRL_FLASH_ACE0_ADDR_S_S)
#define APB_CTRL_FLASH_ACE0_ADDR_S_V  0xffffffff
#define APB_CTRL_FLASH_ACE0_ADDR_S_S  0

/* APB_CTRL_FLASH_ACE1_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE1_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x3c)

/* APB_CTRL_FLASH_ACE1_ADDR_S : R/W; bitpos: [31:0]; default: 268435456;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE1_ADDR_S    0xffffffff
#define APB_CTRL_FLASH_ACE1_ADDR_S_M  (APB_CTRL_FLASH_ACE1_ADDR_S_V << APB_CTRL_FLASH_ACE1_ADDR_S_S)
#define APB_CTRL_FLASH_ACE1_ADDR_S_V  0xffffffff
#define APB_CTRL_FLASH_ACE1_ADDR_S_S  0

/* APB_CTRL_FLASH_ACE2_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE2_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x40)

/* APB_CTRL_FLASH_ACE2_ADDR_S : R/W; bitpos: [31:0]; default: 536870912;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE2_ADDR_S    0xffffffff
#define APB_CTRL_FLASH_ACE2_ADDR_S_M  (APB_CTRL_FLASH_ACE2_ADDR_S_V << APB_CTRL_FLASH_ACE2_ADDR_S_S)
#define APB_CTRL_FLASH_ACE2_ADDR_S_V  0xffffffff
#define APB_CTRL_FLASH_ACE2_ADDR_S_S  0

/* APB_CTRL_FLASH_ACE3_ADDR_REG register
 * ******* Description ***********
 */

