apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
#define APB_CTRL_FLASH_ACE3_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x44)

/* APB_CTRL_FLASH_ACE3_ADDR_S : R/W; bitpos: [31:0]; default: 805306368;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE3_ADDR_S    0xffffffff
#define APB_CTRL_FLASH_ACE3_ADDR_S_M  (APB_CTRL_FLASH_ACE3_ADDR_S_V << APB_CTRL_FLASH_ACE3_ADDR_S_S)
#define APB_CTRL_FLASH_ACE3_ADDR_S_V  0xffffffff
#define APB_CTRL_FLASH_ACE3_ADDR_S_S  0

/* APB_CTRL_FLASH_ACE0_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE0_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x48)

/* APB_CTRL_FLASH_ACE0_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE0_SIZE    0x0000ffff
#define APB_CTRL_FLASH_ACE0_SIZE_M  (APB_CTRL_FLASH_ACE0_SIZE_V << APB_CTRL_FLASH_ACE0_SIZE_S)
#define APB_CTRL_FLASH_ACE0_SIZE_V  0x0000ffff
#define APB_CTRL_FLASH_ACE0_SIZE_S  0

/* APB_CTRL_FLASH_ACE1_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE1_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x4c)

/* APB_CTRL_FLASH_ACE1_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE1_SIZE    0x0000ffff
#define APB_CTRL_FLASH_ACE1_SIZE_M  (APB_CTRL_FLASH_ACE1_SIZE_V << APB_CTRL_FLASH_ACE1_SIZE_S)
#define APB_CTRL_FLASH_ACE1_SIZE_V  0x0000ffff
#define APB_CTRL_FLASH_ACE1_SIZE_S  0

/* APB_CTRL_FLASH_ACE2_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE2_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x50)

/* APB_CTRL_FLASH_ACE2_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE2_SIZE    0x0000ffff
#define APB_CTRL_FLASH_ACE2_SIZE_M  (APB_CTRL_FLASH_ACE2_SIZE_V << APB_CTRL_FLASH_ACE2_SIZE_S)
#define APB_CTRL_FLASH_ACE2_SIZE_V  0x0000ffff
#define APB_CTRL_FLASH_ACE2_SIZE_S  0

/* APB_CTRL_FLASH_ACE3_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE3_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x54)

/* APB_CTRL_FLASH_ACE3_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_FLASH_ACE3_SIZE    0x0000ffff
#define APB_CTRL_FLASH_ACE3_SIZE_M  (APB_CTRL_FLASH_ACE3_SIZE_V << APB_CTRL_FLASH_ACE3_SIZE_S)
#define APB_CTRL_FLASH_ACE3_SIZE_V  0x0000ffff
#define APB_CTRL_FLASH_ACE3_SIZE_S  0

/* APB_CTRL_SRAM_ACE0_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE0_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x58)

/* APB_CTRL_SRAM_ACE0_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE0_ATTR    0x000001ff
#define APB_CTRL_SRAM_ACE0_ATTR_M  (APB_CTRL_SRAM_ACE0_ATTR_V << APB_CTRL_SRAM_ACE0_ATTR_S)
#define APB_CTRL_SRAM_ACE0_ATTR_V  0x000001ff
#define APB_CTRL_SRAM_ACE0_ATTR_S  0

/* APB_CTRL_SRAM_ACE1_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE1_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x5c)

/* APB_CTRL_SRAM_ACE1_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE1_ATTR    0x000001ff
#define APB_CTRL_SRAM_ACE1_ATTR_M  (APB_CTRL_SRAM_ACE1_ATTR_V << APB_CTRL_SRAM_ACE1_ATTR_S)
#define APB_CTRL_SRAM_ACE1_ATTR_V  0x000001ff
#define APB_CTRL_SRAM_ACE1_ATTR_S  0

/* APB_CTRL_SRAM_ACE2_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE2_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x60)

/* APB_CTRL_SRAM_ACE2_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE2_ATTR    0x000001ff
#define APB_CTRL_SRAM_ACE2_ATTR_M  (APB_CTRL_SRAM_ACE2_ATTR_V << APB_CTRL_SRAM_ACE2_ATTR_S)
#define APB_CTRL_SRAM_ACE2_ATTR_V  0x000001ff
#define APB_CTRL_SRAM_ACE2_ATTR_S  0

/* APB_CTRL_SRAM_ACE3_ATTR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE3_ATTR_REG (DR_REG_APB_CTRL_BASE + 0x64)

/* APB_CTRL_SRAM_ACE3_ATTR : R/W; bitpos: [8:0]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE3_ATTR    0x000001ff
#define APB_CTRL_SRAM_ACE3_ATTR_M  (APB_CTRL_SRAM_ACE3_ATTR_V << APB_CTRL_SRAM_ACE3_ATTR_S)
#define APB_CTRL_SRAM_ACE3_ATTR_V  0x000001ff
#define APB_CTRL_SRAM_ACE3_ATTR_S  0

/* APB_CTRL_SRAM_ACE0_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE0_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x68)

/* APB_CTRL_SRAM_ACE0_ADDR_S : R/W; bitpos: [31:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE0_ADDR_S    0xffffffff
#define APB_CTRL_SRAM_ACE0_ADDR_S_M  (APB_CTRL_SRAM_ACE0_ADDR_S_V << APB_CTRL_SRAM_ACE0_ADDR_S_S)
#define APB_CTRL_SRAM_ACE0_ADDR_S_V  0xffffffff
#define APB_CTRL_SRAM_ACE0_ADDR_S_S  0

/* APB_CTRL_SRAM_ACE1_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE1_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x6c)

/* APB_CTRL_SRAM_ACE1_ADDR_S : R/W; bitpos: [31:0]; default: 268435456;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE1_ADDR_S    0xffffffff
#define APB_CTRL_SRAM_ACE1_ADDR_S_M  (APB_CTRL_SRAM_ACE1_ADDR_S_V << APB_CTRL_SRAM_ACE1_ADDR_S_S)
#define APB_CTRL_SRAM_ACE1_ADDR_S_V  0xffffffff
#define APB_CTRL_SRAM_ACE1_ADDR_S_S  0

/* APB_CTRL_SRAM_ACE2_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE2_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x70)

/* APB_CTRL_SRAM_ACE2_ADDR_S : R/W; bitpos: [31:0]; default: 536870912;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE2_ADDR_S    0xffffffff
#define APB_CTRL_SRAM_ACE2_ADDR_S_M  (APB_CTRL_SRAM_ACE2_ADDR_S_V << APB_CTRL_SRAM_ACE2_ADDR_S_S)
#define APB_CTRL_SRAM_ACE2_ADDR_S_V  0xffffffff
#define APB_CTRL_SRAM_ACE2_ADDR_S_S  0

/* APB_CTRL_SRAM_ACE3_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE3_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x74)

/* APB_CTRL_SRAM_ACE3_ADDR_S : R/W; bitpos: [31:0]; default: 805306368;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE3_ADDR_S    0xffffffff
#define APB_CTRL_SRAM_ACE3_ADDR_S_M  (APB_CTRL_SRAM_ACE3_ADDR_S_V << APB_CTRL_SRAM_ACE3_ADDR_S_S)
#define APB_CTRL_SRAM_ACE3_ADDR_S_V  0xffffffff
#define APB_CTRL_SRAM_ACE3_ADDR_S_S  0

/* APB_CTRL_SRAM_ACE0_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE0_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x78)

