apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
/* APB_CTRL_SRAM_ACE0_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE0_SIZE    0x0000ffff
#define APB_CTRL_SRAM_ACE0_SIZE_M  (APB_CTRL_SRAM_ACE0_SIZE_V << APB_CTRL_SRAM_ACE0_SIZE_S)
#define APB_CTRL_SRAM_ACE0_SIZE_V  0x0000ffff
#define APB_CTRL_SRAM_ACE0_SIZE_S  0

/* APB_CTRL_SRAM_ACE1_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE1_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x7c)

/* APB_CTRL_SRAM_ACE1_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE1_SIZE    0x0000ffff
#define APB_CTRL_SRAM_ACE1_SIZE_M  (APB_CTRL_SRAM_ACE1_SIZE_V << APB_CTRL_SRAM_ACE1_SIZE_S)
#define APB_CTRL_SRAM_ACE1_SIZE_V  0x0000ffff
#define APB_CTRL_SRAM_ACE1_SIZE_S  0

/* APB_CTRL_SRAM_ACE2_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE2_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x80)

/* APB_CTRL_SRAM_ACE2_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE2_SIZE    0x0000ffff
#define APB_CTRL_SRAM_ACE2_SIZE_M  (APB_CTRL_SRAM_ACE2_SIZE_V << APB_CTRL_SRAM_ACE2_SIZE_S)
#define APB_CTRL_SRAM_ACE2_SIZE_V  0x0000ffff
#define APB_CTRL_SRAM_ACE2_SIZE_S  0

/* APB_CTRL_SRAM_ACE3_SIZE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE3_SIZE_REG (DR_REG_APB_CTRL_BASE + 0x84)

/* APB_CTRL_SRAM_ACE3_SIZE : R/W; bitpos: [15:0]; default: 4096;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_ACE3_SIZE    0x0000ffff
#define APB_CTRL_SRAM_ACE3_SIZE_M  (APB_CTRL_SRAM_ACE3_SIZE_V << APB_CTRL_SRAM_ACE3_SIZE_S)
#define APB_CTRL_SRAM_ACE3_SIZE_V  0x0000ffff
#define APB_CTRL_SRAM_ACE3_SIZE_S  0

/* APB_CTRL_SPI_MEM_PMS_CTRL_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_PMS_CTRL_REG (DR_REG_APB_CTRL_BASE + 0x88)

/* APB_CTRL_SPI_MEM_REJECT_CDE : RO; bitpos: [6:2]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_REJECT_CDE    0x0000001f
#define APB_CTRL_SPI_MEM_REJECT_CDE_M  (APB_CTRL_SPI_MEM_REJECT_CDE_V << APB_CTRL_SPI_MEM_REJECT_CDE_S)
#define APB_CTRL_SPI_MEM_REJECT_CDE_V  0x0000001f
#define APB_CTRL_SPI_MEM_REJECT_CDE_S  2

/* APB_CTRL_SPI_MEM_REJECT_CLR : WOD; bitpos: [1]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_REJECT_CLR    (BIT(1))
#define APB_CTRL_SPI_MEM_REJECT_CLR_M  (APB_CTRL_SPI_MEM_REJECT_CLR_V << APB_CTRL_SPI_MEM_REJECT_CLR_S)
#define APB_CTRL_SPI_MEM_REJECT_CLR_V  0x00000001
#define APB_CTRL_SPI_MEM_REJECT_CLR_S  1

/* APB_CTRL_SPI_MEM_REJECT_INT : RO; bitpos: [0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_REJECT_INT    (BIT(0))
#define APB_CTRL_SPI_MEM_REJECT_INT_M  (APB_CTRL_SPI_MEM_REJECT_INT_V << APB_CTRL_SPI_MEM_REJECT_INT_S)
#define APB_CTRL_SPI_MEM_REJECT_INT_V  0x00000001
#define APB_CTRL_SPI_MEM_REJECT_INT_S  0

/* APB_CTRL_SPI_MEM_REJECT_ADDR_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_REJECT_ADDR_REG (DR_REG_APB_CTRL_BASE + 0x8c)

/* APB_CTRL_SPI_MEM_REJECT_ADDR : RO; bitpos: [31:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_REJECT_ADDR    0xffffffff
#define APB_CTRL_SPI_MEM_REJECT_ADDR_M  (APB_CTRL_SPI_MEM_REJECT_ADDR_V << APB_CTRL_SPI_MEM_REJECT_ADDR_S)
#define APB_CTRL_SPI_MEM_REJECT_ADDR_V  0xffffffff
#define APB_CTRL_SPI_MEM_REJECT_ADDR_S  0

/* APB_CTRL_SDIO_CTRL_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SDIO_CTRL_REG (DR_REG_APB_CTRL_BASE + 0x90)

/* APB_CTRL_SDIO_WIN_ACCESS_EN : R/W; bitpos: [0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SDIO_WIN_ACCESS_EN    (BIT(0))
#define APB_CTRL_SDIO_WIN_ACCESS_EN_M  (APB_CTRL_SDIO_WIN_ACCESS_EN_V << APB_CTRL_SDIO_WIN_ACCESS_EN_S)
#define APB_CTRL_SDIO_WIN_ACCESS_EN_V  0x00000001
#define APB_CTRL_SDIO_WIN_ACCESS_EN_S  0

/* APB_CTRL_REDCY_SIG0_REG register
 * ******* Description ***********
 */

#define APB_CTRL_REDCY_SIG0_REG (DR_REG_APB_CTRL_BASE + 0x94)

/* APB_CTRL_REDCY_ANDOR : RO; bitpos: [31]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_REDCY_ANDOR    (BIT(31))
#define APB_CTRL_REDCY_ANDOR_M  (APB_CTRL_REDCY_ANDOR_V << APB_CTRL_REDCY_ANDOR_S)
#define APB_CTRL_REDCY_ANDOR_V  0x00000001
#define APB_CTRL_REDCY_ANDOR_S  31

/* APB_CTRL_REDCY_SIG0 : R/W; bitpos: [30:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_REDCY_SIG0    0x7fffffff
#define APB_CTRL_REDCY_SIG0_M  (APB_CTRL_REDCY_SIG0_V << APB_CTRL_REDCY_SIG0_S)
#define APB_CTRL_REDCY_SIG0_V  0x7fffffff
#define APB_CTRL_REDCY_SIG0_S  0

/* APB_CTRL_REDCY_SIG1_REG register
 * ******* Description ***********
 */

#define APB_CTRL_REDCY_SIG1_REG (DR_REG_APB_CTRL_BASE + 0x98)

/* APB_CTRL_REDCY_NANDOR : RO; bitpos: [31]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_REDCY_NANDOR    (BIT(31))
#define APB_CTRL_REDCY_NANDOR_M  (APB_CTRL_REDCY_NANDOR_V << APB_CTRL_REDCY_NANDOR_S)
#define APB_CTRL_REDCY_NANDOR_V  0x00000001
#define APB_CTRL_REDCY_NANDOR_S  31

/* APB_CTRL_REDCY_SIG1 : R/W; bitpos: [30:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_REDCY_SIG1    0x7fffffff
#define APB_CTRL_REDCY_SIG1_M  (APB_CTRL_REDCY_SIG1_V << APB_CTRL_REDCY_SIG1_S)
#define APB_CTRL_REDCY_SIG1_V  0x7fffffff
#define APB_CTRL_REDCY_SIG1_S  0

/* APB_CTRL_FRONT_END_MEM_PD_REG register
 * ******* Description ***********
 */

#define APB_CTRL_FRONT_END_MEM_PD_REG (DR_REG_APB_CTRL_BASE + 0x9c)

/* APB_CTRL_FREQ_MEM_FORCE_PD : R/W; bitpos: [7]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_FREQ_MEM_FORCE_PD    (BIT(7))
#define APB_CTRL_FREQ_MEM_FORCE_PD_M  (APB_CTRL_FREQ_MEM_FORCE_PD_V << APB_CTRL_FREQ_MEM_FORCE_PD_S)
#define APB_CTRL_FREQ_MEM_FORCE_PD_V  0x00000001
#define APB_CTRL_FREQ_MEM_FORCE_PD_S  7

/* APB_CTRL_FREQ_MEM_FORCE_PU : R/W; bitpos: [6]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_FREQ_MEM_FORCE_PU    (BIT(6))
#define APB_CTRL_FREQ_MEM_FORCE_PU_M  (APB_CTRL_FREQ_MEM_FORCE_PU_V << APB_CTRL_FREQ_MEM_FORCE_PU_S)
#define APB_CTRL_FREQ_MEM_FORCE_PU_V  0x00000001
#define APB_CTRL_FREQ_MEM_FORCE_PU_S  6

/* APB_CTRL_DC_MEM_FORCE_PD : R/W; bitpos: [5]; default: 0;
 * ******* Description ***********
 */

