apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
#define APB_CTRL_DC_MEM_FORCE_PD    (BIT(5))
#define APB_CTRL_DC_MEM_FORCE_PD_M  (APB_CTRL_DC_MEM_FORCE_PD_V << APB_CTRL_DC_MEM_FORCE_PD_S)
#define APB_CTRL_DC_MEM_FORCE_PD_V  0x00000001
#define APB_CTRL_DC_MEM_FORCE_PD_S  5

/* APB_CTRL_DC_MEM_FORCE_PU : R/W; bitpos: [4]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_DC_MEM_FORCE_PU    (BIT(4))
#define APB_CTRL_DC_MEM_FORCE_PU_M  (APB_CTRL_DC_MEM_FORCE_PU_V << APB_CTRL_DC_MEM_FORCE_PU_S)
#define APB_CTRL_DC_MEM_FORCE_PU_V  0x00000001
#define APB_CTRL_DC_MEM_FORCE_PU_S  4

/* APB_CTRL_PBUS_MEM_FORCE_PD : R/W; bitpos: [3]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_PBUS_MEM_FORCE_PD    (BIT(3))
#define APB_CTRL_PBUS_MEM_FORCE_PD_M  (APB_CTRL_PBUS_MEM_FORCE_PD_V << APB_CTRL_PBUS_MEM_FORCE_PD_S)
#define APB_CTRL_PBUS_MEM_FORCE_PD_V  0x00000001
#define APB_CTRL_PBUS_MEM_FORCE_PD_S  3

/* APB_CTRL_PBUS_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_PBUS_MEM_FORCE_PU    (BIT(2))
#define APB_CTRL_PBUS_MEM_FORCE_PU_M  (APB_CTRL_PBUS_MEM_FORCE_PU_V << APB_CTRL_PBUS_MEM_FORCE_PU_S)
#define APB_CTRL_PBUS_MEM_FORCE_PU_V  0x00000001
#define APB_CTRL_PBUS_MEM_FORCE_PU_S  2

/* APB_CTRL_AGC_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_AGC_MEM_FORCE_PD    (BIT(1))
#define APB_CTRL_AGC_MEM_FORCE_PD_M  (APB_CTRL_AGC_MEM_FORCE_PD_V << APB_CTRL_AGC_MEM_FORCE_PD_S)
#define APB_CTRL_AGC_MEM_FORCE_PD_V  0x00000001
#define APB_CTRL_AGC_MEM_FORCE_PD_S  1

/* APB_CTRL_AGC_MEM_FORCE_PU : R/W; bitpos: [0]; default: 1;
 * ******* Description ***********
 */

#define APB_CTRL_AGC_MEM_FORCE_PU    (BIT(0))
#define APB_CTRL_AGC_MEM_FORCE_PU_M  (APB_CTRL_AGC_MEM_FORCE_PU_V << APB_CTRL_AGC_MEM_FORCE_PU_S)
#define APB_CTRL_AGC_MEM_FORCE_PU_V  0x00000001
#define APB_CTRL_AGC_MEM_FORCE_PU_S  0

/* APB_CTRL_SPI_MEM_ECC_CTRL_REG register
 * ******* Description ***********
 */

#define APB_CTRL_SPI_MEM_ECC_CTRL_REG (DR_REG_APB_CTRL_BASE + 0xa0)

/* APB_CTRL_SRAM_PAGE_SIZE : R/W; bitpos: [21:20]; default: 2;
 * Set the page size of the used MSPI external RAM. 0: 256 bytes. 1: 512
 * bytes. 2: 1024 bytes. 3: 2048 bytes.
 */

#define APB_CTRL_SRAM_PAGE_SIZE    0x00000003
#define APB_CTRL_SRAM_PAGE_SIZE_M  (APB_CTRL_SRAM_PAGE_SIZE_V << APB_CTRL_SRAM_PAGE_SIZE_S)
#define APB_CTRL_SRAM_PAGE_SIZE_V  0x00000003
#define APB_CTRL_SRAM_PAGE_SIZE_S  20

/* APB_CTRL_FLASH_PAGE_SIZE : R/W; bitpos: [19:18]; default: 0;
 * Set the page size of the used MSPI flash. 0: 256 bytes. 1: 512 bytes. 2:
 * 1024 bytes. 3: 2048 bytes.
 */

#define APB_CTRL_FLASH_PAGE_SIZE    0x00000003
#define APB_CTRL_FLASH_PAGE_SIZE_M  (APB_CTRL_FLASH_PAGE_SIZE_V << APB_CTRL_FLASH_PAGE_SIZE_S)
#define APB_CTRL_FLASH_PAGE_SIZE_V  0x00000003
#define APB_CTRL_FLASH_PAGE_SIZE_S  18

/* APB_CTRL_CLKGATE_FORCE_ON_REG register
 * ******* Description ***********
 */

#define APB_CTRL_CLKGATE_FORCE_ON_REG (DR_REG_APB_CTRL_BASE + 0xa8)

/* APB_CTRL_SRAM_CLKGATE_FORCE_ON : R/W; bitpos: [13:3]; default: 2047;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_CLKGATE_FORCE_ON    0x000007ff
#define APB_CTRL_SRAM_CLKGATE_FORCE_ON_M  (APB_CTRL_SRAM_CLKGATE_FORCE_ON_V << APB_CTRL_SRAM_CLKGATE_FORCE_ON_S)
#define APB_CTRL_SRAM_CLKGATE_FORCE_ON_V  0x000007ff
#define APB_CTRL_SRAM_CLKGATE_FORCE_ON_S  3

/* APB_CTRL_ROM_CLKGATE_FORCE_ON : R/W; bitpos: [2:0]; default: 7;
 * ******* Description ***********
 */

#define APB_CTRL_ROM_CLKGATE_FORCE_ON    0x00000007
#define APB_CTRL_ROM_CLKGATE_FORCE_ON_M  (APB_CTRL_ROM_CLKGATE_FORCE_ON_V << APB_CTRL_ROM_CLKGATE_FORCE_ON_S)
#define APB_CTRL_ROM_CLKGATE_FORCE_ON_V  0x00000007
#define APB_CTRL_ROM_CLKGATE_FORCE_ON_S  0

/* APB_CTRL_MEM_POWER_DOWN_REG register
 * ******* Description ***********
 */

#define APB_CTRL_MEM_POWER_DOWN_REG (DR_REG_APB_CTRL_BASE + 0xac)

/* APB_CTRL_SRAM_POWER_DOWN : R/W; bitpos: [13:3]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_POWER_DOWN    0x000007ff
#define APB_CTRL_SRAM_POWER_DOWN_M  (APB_CTRL_SRAM_POWER_DOWN_V << APB_CTRL_SRAM_POWER_DOWN_S)
#define APB_CTRL_SRAM_POWER_DOWN_V  0x000007ff
#define APB_CTRL_SRAM_POWER_DOWN_S  3

/* APB_CTRL_ROM_POWER_DOWN : R/W; bitpos: [2:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_ROM_POWER_DOWN    0x00000007
#define APB_CTRL_ROM_POWER_DOWN_M  (APB_CTRL_ROM_POWER_DOWN_V << APB_CTRL_ROM_POWER_DOWN_S)
#define APB_CTRL_ROM_POWER_DOWN_V  0x00000007
#define APB_CTRL_ROM_POWER_DOWN_S  0

/* APB_CTRL_MEM_POWER_UP_REG register
 * ******* Description ***********
 */

#define APB_CTRL_MEM_POWER_UP_REG (DR_REG_APB_CTRL_BASE + 0xb0)

/* APB_CTRL_SRAM_POWER_UP : R/W; bitpos: [13:3]; default: 2047;
 * ******* Description ***********
 */

#define APB_CTRL_SRAM_POWER_UP    0x000007ff
#define APB_CTRL_SRAM_POWER_UP_M  (APB_CTRL_SRAM_POWER_UP_V << APB_CTRL_SRAM_POWER_UP_S)
#define APB_CTRL_SRAM_POWER_UP_V  0x000007ff
#define APB_CTRL_SRAM_POWER_UP_S  3

/* APB_CTRL_ROM_POWER_UP : R/W; bitpos: [2:0]; default: 7;
 * ******* Description ***********
 */

#define APB_CTRL_ROM_POWER_UP    0x00000007
#define APB_CTRL_ROM_POWER_UP_M  (APB_CTRL_ROM_POWER_UP_V << APB_CTRL_ROM_POWER_UP_S)
#define APB_CTRL_ROM_POWER_UP_V  0x00000007
#define APB_CTRL_ROM_POWER_UP_S  0

/* APB_CTRL_RETENTION_CTRL_REG register
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CTRL_REG (DR_REG_APB_CTRL_BASE + 0xb4)

/* APB_CTRL_NOBYPASS_CPU_ISO_RST : R/W; bitpos: [27]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_NOBYPASS_CPU_ISO_RST    (BIT(27))
#define APB_CTRL_NOBYPASS_CPU_ISO_RST_M  (APB_CTRL_NOBYPASS_CPU_ISO_RST_V << APB_CTRL_NOBYPASS_CPU_ISO_RST_S)
#define APB_CTRL_NOBYPASS_CPU_ISO_RST_V  0x00000001
#define APB_CTRL_NOBYPASS_CPU_ISO_RST_S  27

/* APB_CTRL_RETENTION_CPU_LINK_ADDR : R/W; bitpos: [26:0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CPU_LINK_ADDR    0x07ffffff
#define APB_CTRL_RETENTION_CPU_LINK_ADDR_M  (APB_CTRL_RETENTION_CPU_LINK_ADDR_V << APB_CTRL_RETENTION_CPU_LINK_ADDR_S)
#define APB_CTRL_RETENTION_CPU_LINK_ADDR_V  0x07ffffff
#define APB_CTRL_RETENTION_CPU_LINK_ADDR_S  0

/* APB_CTRL_RETENTION_CTRL1_REG register
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CTRL1_REG (DR_REG_APB_CTRL_BASE + 0xb8)

/* APB_CTRL_RETENTION_TAG_LINK_ADDR : R/W; bitpos: [26:0]; default: 0;
 * ******* Description ***********
 */

