apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_apb_ctrl.h
#define APB_CTRL_RETENTION_TAG_LINK_ADDR    0x07ffffff
#define APB_CTRL_RETENTION_TAG_LINK_ADDR_M  (APB_CTRL_RETENTION_TAG_LINK_ADDR_V << APB_CTRL_RETENTION_TAG_LINK_ADDR_S)
#define APB_CTRL_RETENTION_TAG_LINK_ADDR_V  0x07ffffff
#define APB_CTRL_RETENTION_TAG_LINK_ADDR_S  0

/* APB_CTRL_RETENTION_CTRL2_REG register
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CTRL2_REG (DR_REG_APB_CTRL_BASE + 0xbc)

/* APB_CTRL_RET_ICACHE_ENABLE : R/W; bitpos: [31]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RET_ICACHE_ENABLE    (BIT(31))
#define APB_CTRL_RET_ICACHE_ENABLE_M  (APB_CTRL_RET_ICACHE_ENABLE_V << APB_CTRL_RET_ICACHE_ENABLE_S)
#define APB_CTRL_RET_ICACHE_ENABLE_V  0x00000001
#define APB_CTRL_RET_ICACHE_ENABLE_S  31

/* APB_CTRL_RET_ICACHE_START_POINT : R/W; bitpos: [29:22]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RET_ICACHE_START_POINT    0x000000ff
#define APB_CTRL_RET_ICACHE_START_POINT_M  (APB_CTRL_RET_ICACHE_START_POINT_V << APB_CTRL_RET_ICACHE_START_POINT_S)
#define APB_CTRL_RET_ICACHE_START_POINT_V  0x000000ff
#define APB_CTRL_RET_ICACHE_START_POINT_S  22

/* APB_CTRL_RET_ICACHE_VLD_SIZE : R/W; bitpos: [20:13]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_RET_ICACHE_VLD_SIZE    0x000000ff
#define APB_CTRL_RET_ICACHE_VLD_SIZE_M  (APB_CTRL_RET_ICACHE_VLD_SIZE_V << APB_CTRL_RET_ICACHE_VLD_SIZE_S)
#define APB_CTRL_RET_ICACHE_VLD_SIZE_V  0x000000ff
#define APB_CTRL_RET_ICACHE_VLD_SIZE_S  13

/* APB_CTRL_RET_ICACHE_SIZE : R/W; bitpos: [11:4]; default: 255;
 * ******* Description ***********
 */

#define APB_CTRL_RET_ICACHE_SIZE    0x000000ff
#define APB_CTRL_RET_ICACHE_SIZE_M  (APB_CTRL_RET_ICACHE_SIZE_V << APB_CTRL_RET_ICACHE_SIZE_S)
#define APB_CTRL_RET_ICACHE_SIZE_V  0x000000ff
#define APB_CTRL_RET_ICACHE_SIZE_S  4

/* APB_CTRL_RETENTION_CTRL3_REG register
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CTRL3_REG (DR_REG_APB_CTRL_BASE + 0xc0)

/* APB_CTRL_RET_DCACHE_ENABLE : R/W; bitpos: [31]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RET_DCACHE_ENABLE    (BIT(31))
#define APB_CTRL_RET_DCACHE_ENABLE_M  (APB_CTRL_RET_DCACHE_ENABLE_V << APB_CTRL_RET_DCACHE_ENABLE_S)
#define APB_CTRL_RET_DCACHE_ENABLE_V  0x00000001
#define APB_CTRL_RET_DCACHE_ENABLE_S  31

/* APB_CTRL_RET_DCACHE_START_POINT : R/W; bitpos: [30:22]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RET_DCACHE_START_POINT    0x000001ff
#define APB_CTRL_RET_DCACHE_START_POINT_M  (APB_CTRL_RET_DCACHE_START_POINT_V << APB_CTRL_RET_DCACHE_START_POINT_S)
#define APB_CTRL_RET_DCACHE_START_POINT_V  0x000001ff
#define APB_CTRL_RET_DCACHE_START_POINT_S  22

/* APB_CTRL_RET_DCACHE_VLD_SIZE : R/W; bitpos: [21:13]; default: 511;
 * ******* Description ***********
 */

#define APB_CTRL_RET_DCACHE_VLD_SIZE    0x000001ff
#define APB_CTRL_RET_DCACHE_VLD_SIZE_M  (APB_CTRL_RET_DCACHE_VLD_SIZE_V << APB_CTRL_RET_DCACHE_VLD_SIZE_S)
#define APB_CTRL_RET_DCACHE_VLD_SIZE_V  0x000001ff
#define APB_CTRL_RET_DCACHE_VLD_SIZE_S  13

/* APB_CTRL_RET_DCACHE_SIZE : R/W; bitpos: [12:4]; default: 511;
 * ******* Description ***********
 */

#define APB_CTRL_RET_DCACHE_SIZE    0x000001ff
#define APB_CTRL_RET_DCACHE_SIZE_M  (APB_CTRL_RET_DCACHE_SIZE_V << APB_CTRL_RET_DCACHE_SIZE_S)
#define APB_CTRL_RET_DCACHE_SIZE_V  0x000001ff
#define APB_CTRL_RET_DCACHE_SIZE_S  4

/* APB_CTRL_RETENTION_CTRL4_REG register
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CTRL4_REG (DR_REG_APB_CTRL_BASE + 0xc4)

/* APB_CTRL_RETENTION_INV_CFG : R/W; bitpos: [31:0]; default: 4294967295;
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_INV_CFG    0xffffffff
#define APB_CTRL_RETENTION_INV_CFG_M  (APB_CTRL_RETENTION_INV_CFG_V << APB_CTRL_RETENTION_INV_CFG_S)
#define APB_CTRL_RETENTION_INV_CFG_V  0xffffffff
#define APB_CTRL_RETENTION_INV_CFG_S  0

/* APB_CTRL_RETENTION_CTRL5_REG register
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_CTRL5_REG (DR_REG_APB_CTRL_BASE + 0xc8)

/* APB_CTRL_RETENTION_DISABLE : R/W; bitpos: [0]; default: 0;
 * ******* Description ***********
 */

#define APB_CTRL_RETENTION_DISABLE    (BIT(0))
#define APB_CTRL_RETENTION_DISABLE_M  (APB_CTRL_RETENTION_DISABLE_V << APB_CTRL_RETENTION_DISABLE_S)
#define APB_CTRL_RETENTION_DISABLE_V  0x00000001
#define APB_CTRL_RETENTION_DISABLE_S  0

/* APB_CTRL_DATE_REG register
 * ******* Description ***********
 */

#define APB_CTRL_DATE_REG (DR_REG_APB_CTRL_BASE + 0x3fc)

/* APB_CTRL_DATE : R/W; bitpos: [31:0]; default: 34607440;
 * Version control
 */

#define APB_CTRL_DATE    0xffffffff
#define APB_CTRL_DATE_M  (APB_CTRL_DATE_V << APB_CTRL_DATE_S)
#define APB_CTRL_DATE_V  0xffffffff
#define APB_CTRL_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_APB_CTRL_H */
